# RollBack Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCTransaction..::..RollBack Method
IFCTransaction Class See Also
---
Rolls back all changes made to the IFC file during the transaction.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void RollBack()
```

Visual Basic
---
```text
Public Sub RollBack
```

Visual C++
---
```text
public:
void RollBack()
```

# See Also
IFCTransaction Class
Autodesk.Revit.DB.IFC Namespace